import type { Range, WeaponClass } from "../types/weapon";

export const weaponClasses: WeaponClass[] = [
  "シューター",
  "ブラスター",
  "ローラー",
  "フデ",
  "チャージャー",
  "スロッシャー",
  "スピナー",
  "マニューバー",
  "シェルター",
  "ストリンガー",
  "ワイパー",
];

export const subWeapons: string[] = [
  "スプラッシュボム",
  "キューバンボム",
  "クイックボム",
  "スプリンクラー",
  "ジャンプビーコン",
  "スプラッシュシールド",
  "ポイントセンサー",
  "トラップ",
  "カーリングボム",
  "ロボットボム",
  "タンサンボム",
  "トーピード",
  "ラインマーカー",
  "ポイズンミスト",
];

export const specialWeapons: string[] = [
  "ウルトラショット",
  "グレートバリア",
  "サメライド",
  "ショクワンダー",
  "ホップソナー",
  "メガホンレーザー5.1ch",
  "マルチミサイル",
  "ナイスダマ",
  "アメフラシ",
  "キューインキ",
  "エナジースタンド",
  "カニタンク",
  "ジェットパック",
  "トリプルトルネード",
  "テイオウイカ",
  "スミナガシート",
  "デコイチラシ",
  "ウルトラチャクチ",
  "スーパーチャクチ",
];

export const ranges: Range[] = ["短", "中短", "中", "中長", "長"];
